<summary>terraform plan</summary>

<details>

```tf
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app.aws_cloudwatch_log_group.ecs_web will be created
  + resource "aws_cloudwatch_log_group" "ecs_web" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "staging-app-web-ecs"
      + retention_in_days = 7
      + tags              = {
          + "Environment" = "staging"
          + "Name"        = "staging_app_web_ecs"
        }
    }

  # module.app.aws_ecs_cluster.app will be created
  + resource "aws_ecs_cluster" "app" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "staging_app"
      + tags = {
          + "Environment" = "staging"
          + "Name"        = "staging_app"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.app.aws_ecs_task_definition.app_web will be created
  + resource "aws_ecs_task_definition" "app_web" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "RAILS_ENV"
                          + value = "staging"
                        },
                    ]
                  + essential        = true
                  + image            = "464352955943.dkr.ecr.ap-northeast-1.amazonaws.com/rails-api:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "staging-app-web-ecs"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 461
                  + name             = "web"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "RAILS_LOG_TO_STDOUT"
                          + valueFrom = "STAGING_RAILS_LOG_TO_STDOUT"
                        },
                      + {
                          + name      = "RAILS_MAX_THREADS"
                          + valueFrom = "STAGING_RAILS_MAX_THREADS"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "staging_app_web_task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # module.app.aws_iam_role.ecs_role will be created
  + resource "aws_iam_role" "ecs_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ecs.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                              + "application-autoscaling.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-app-ecs"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "Name"        = "staging_app_ecs"
        }
      + unique_id             = (known after apply)
    }

  # module.app.aws_iam_role_policy.ecs_secretsmanager will be created
  + resource "aws_iam_role_policy" "ecs_secretsmanager" {
      + id     = (known after apply)
      + name   = "staging_ecs_secretsmanager"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "secretsmanager:GetSecretValue",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ap-northeast-1:464352955943:parameter/*",
                          + "arn:aws:secretsmanager:ap-northeast-1:464352955943:secret:*",
                          + "arn:aws:kms:ap-northeast-1:464352955943:key:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.app.aws_iam_role_policy_attachment.ecr_power_user will be created
  + resource "aws_iam_role_policy_attachment" "ecr_power_user" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPowerUser"
      + role       = (known after apply)
    }

  # module.app.aws_iam_role_policy_attachment.ecs_service will be created
  + resource "aws_iam_role_policy_attachment" "ecs_service" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceRole"
      + role       = (known after apply)
    }

  # module.app.aws_iam_role_policy_attachment.ecs_task will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>